'use strict';
/*Написати функцію, яка приймає 1 параметр. з тим, що передали перший раз і т. д. Все це із замиканнями, наприклад:

sum(3) = 3 

sum(5) = 8

sum(20) = 28*/




//Зовнішня функція
function mathResult(){
  let count = 0;// можна зробити у даному завданні змінну глобальною, буде працювати так само

  //Внутрішня функція
  function plus(num){
    count += num;//Дія, що виконує наша функція plus
    return count;//Повертаємо результат функції count(нове значення)
  }

  return plus;//Повертаємо результат функції plus

}

const sum = mathResult();//Викликаємо зовнішню функцію mathResult, яка повертає внутрішню plus
console.log(sum(3));//Виведе 3
console.log(sum(5));//Виведе 5
console.log(sum(20));//Виведе 28